package chap08.generalrules;

/***************************************************************************************************************************
	Rule 55 - 신중하게 최적화 하라
	
	1. 빠른 프로그램을 만들고자 애쓰지 말고 좋은 프로그램을 짜기 위해 애쓰라.
	2. 시스템 설계 시, 특히 API나 통신 프로토콜 또는 지속성 데이터 형식을 설계할 경우에는 성능 문제를 따져보라.
	3. 시스템 구현을 마친 후 성능을 측정 해 보라.
	4. 프로파일링 도구를 이용하면 성능 최적화할 부분을 쉽게 찾을 수 있음.
	5. 최적화 시 가장 처음해야 할 일은 구현에 쓰인 알고리즘을 검토하는 일임.
***************************************************************************************************************************/
